class QuestionRepository {
  List<String> types = ['블록종류1', '블록종류2', '블록종류3', '블록종류4', '블록종류5'];

  Map<String, List<String>> blocksByType = {
    '블록종류1': ['블록1-1', '블록1-2', '블록1-3', '블록1-4', '블록1-5', '블록1-6', '블록1-7', '블록1-8'],
    '블록종류2': ['블록2-1', '블록2-2', '블록2-3', '블록2-4', '블록2-5', '블록2-6', '블록2-7', '블록2-8'],
    '블록종류3': ['블록3-1', '블록3-2', '블록3-3', '블록3-4', '블록3-5', '블록3-6', '블록3-7', '블록3-8'],
    '블록종류4': ['블록4-1', '블록4-2', '블록4-3', '블록4-4', '블록4-5', '블록4-6', '블록4-7', '블록4-8'],
    '블록종류5': ['블록5-1', '블록5-2', '블록5-3', '블록5-4', '블록5-5', '블록5-6', '블록5-7', '블록5-8'],
  };
}
